{"format": "graph-model", "generatedBy": "2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"isholiday:0": {"name": "isholiday:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "hour:0": {"name": "hour:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "eventtype:0": {"name": "eventtype:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "band:0": {"name": "band:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "week:0": {"name": "week:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "time": {"name": "time:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "timestamp:0": {"name": "timestamp:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "average:0": {"name": "average:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}, "outputs": {"main_output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_15/embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_15/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/model_15/embedding_1/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_15/flatten_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_15/batch_normalization/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_15/batch_normalization/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_15/batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_15/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/model_15/embedding_2/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_15/flatten_2/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}, {"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/model_15/embedding_3/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_15/flatten_3/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_15/batch_normalization_2/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_15/batch_normalization_2/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_15/concatenate/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_15/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "21"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_15/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_15/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_15/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_15/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_15/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_15/main_output/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_15/main_output/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "average", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "band", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT32"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "eventtype", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "hour", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT32"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "isholiday", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "time", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, {"name": "timestamp", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "week", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_15/batch_normalization_2/batchnorm/mul_1", "op": "Mul", "input": ["average", "StatefulPartitionedCall/model_15/batch_normalization_2/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_15/embedding_1/embedding_lookup", "op": "GatherV2", "input": ["unknown_1", "band", "StatefulPartitionedCall/model_15/embedding_1/embedding_lookup/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_15/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown_2", "eventtype", "StatefulPartitionedCall/model_15/embedding/embedding_lookup/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_15/embedding_3/embedding_lookup", "op": "GatherV2", "input": ["unknown", "hour", "StatefulPartitionedCall/model_15/embedding_3/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_15/batch_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["time", "StatefulPartitionedCall/model_15/batch_normalization_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_15/batch_normalization/batchnorm/mul_1", "op": "Mul", "input": ["timestamp", "StatefulPartitionedCall/model_15/batch_normalization/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_15/embedding_2/embedding_lookup", "op": "GatherV2", "input": ["unknown_0", "week", "StatefulPartitionedCall/model_15/embedding_2/embedding_lookup/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_15/batch_normalization_2/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model_15/batch_normalization_2/batchnorm/mul_1", "StatefulPartitionedCall/model_15/batch_normalization_2/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_15/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_15/embedding_1/embedding_lookup", "StatefulPartitionedCall/model_15/flatten_1/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_15/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_15/embedding/embedding_lookup", "StatefulPartitionedCall/model_15/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_15/flatten_3/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_15/embedding_3/embedding_lookup", "StatefulPartitionedCall/model_15/flatten_3/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_15/batch_normalization_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model_15/batch_normalization_1/batchnorm/mul_1", "StatefulPartitionedCall/model_15/batch_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_15/batch_normalization/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model_15/batch_normalization/batchnorm/mul_1", "StatefulPartitionedCall/model_15/batch_normalization/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_15/flatten_2/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_15/embedding_2/embedding_lookup", "StatefulPartitionedCall/model_15/flatten_2/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_15/concatenate/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_15/flatten/Reshape", "StatefulPartitionedCall/model_15/flatten_1/Reshape", "StatefulPartitionedCall/model_15/batch_normalization/batchnorm/add_1", "StatefulPartitionedCall/model_15/batch_normalization_1/batchnorm/add_1", "StatefulPartitionedCall/model_15/flatten_2/Reshape", "StatefulPartitionedCall/model_15/flatten_3/Reshape", "isholiday", "StatefulPartitionedCall/model_15/batch_normalization_2/batchnorm/add_1", "StatefulPartitionedCall/model_15/concatenate/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "8"}}}, {"name": "StatefulPartitionedCall/model_15/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_15/concatenate/concat", "StatefulPartitionedCall/model_15/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_15/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_15/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_15/dense/Relu", "StatefulPartitionedCall/model_15/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_15/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model_15/dense_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_15/dense_1/Relu", "StatefulPartitionedCall/model_15/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_15/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_15/main_output/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_15/dense_2/Relu", "StatefulPartitionedCall/model_15/main_output/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_15/main_output/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_15/main_output/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_15/main_output/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_15/main_output/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown_2", "shape": [8, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/embedding/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_15/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_1", "shape": [10, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/embedding_1/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_15/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_15/batch_normalization/batchnorm/mul", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/batch_normalization/batchnorm/sub", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/batch_normalization_1/batchnorm/mul", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/batch_normalization_1/batchnorm/sub", "shape": [2], "dtype": "float32"}, {"name": "unknown_0", "shape": [7, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/embedding_2/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_15/flatten_2/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown", "shape": [24, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/embedding_3/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_15/flatten_3/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_15/batch_normalization_2/batchnorm/mul", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/batch_normalization_2/batchnorm/sub", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/concatenate/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_15/dense/MatMul/ReadVariableOp", "shape": [21, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/dense/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/dense_1/MatMul/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/dense_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/dense_2/MatMul/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/dense_2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/main_output/MatMul/ReadVariableOp", "shape": [64, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_15/main_output/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}